public class Test3 {


    public static void main(String[] args) {

        청둥오리 a청둥오리 = new 청둥오리(); // 청둥오리가 만들어집니다. 청둥오리는 기본 날개를 가지고 태어납니다.
        a청둥오리.생성();
        a청둥오리.날다(); // 청둥오리가 날개로 천천히 날아갑니다.
        System.out.println("==================================================");
        흰오리 a흰오리 = new 흰오리(); // 흰오리가 만들어집니다. 청둥오리는 불사조 날개를 가지고 태어납니다.
        a흰오리.생성();
        a흰오리.날다(); // 흰오리가 불사조 날개로 불타오르며 날아갑니다.
        System.out.println("==================================================");
        붉은오리 a붉은오리 = new 붉은오리(); // 붉은오리가 만들어집니다. 붉은오리는 로켓 날개를 가지고 태어납니다.
        a붉은오리.생성();
        a붉은오리.날다(); // 붉은오리가 로켓날개로 놀라운 속도로 굉음을 내며 날아갑니다

    }
}


class 청둥오리 {

    public void 생성() {
        System.out.println("청둥오리가 만들어집니다. 청둥오리는 기본 날개를 가지고 태어납니다.");
    }

    public void 날다() {
        System.out.println("청둥오리가 날개로 날아갑니다.");
    }
}

class 흰오리 extends 청둥오리 {
    public void 생성() {
        System.out.println("흰오리가 만들어집니다. 청둥오리는 불사조 날개를 가지고 태어납니다.");
    }

    public void 날다() {
        System.out.println("흰오리가 불사조 날개로 불타오르며 날아갑니다.");
    }

}

class 붉은오리 extends 청둥오리 {
    public void 생성() {
        System.out.println("붉은오리가 만들어집니다. 붉은오리는 로켓 날개를 가지고 태어납니다.");
    }

    public void 날다() {
        System.out.println("붉은오리가 로켓날개로 놀라운 속도로 굉음을 내며 날아갑니다.");
    }

}

